ros2/freertps/systems/stm32_common/enet.c
static bool eth_dispatch_udp(const uint8_t *data, const uint16_t len)
{
  const eth_udp_header_t *udp = (const eth_udp_header_t *)data;
  const uint16_t port = eth_htons(udp->dest_port);
  const uint16_t payload_len = eth_htons(udp->len) - 8;
  const uint8_t *payload = data + sizeof(eth_udp_header_t);
  //printf("  udp len: %d\r\n", udp_payload_len);
  if (payload_len > len - sizeof(eth_udp_header_t))
    return false; // ignore fragmented UDP packets.
  //printf("dispatch udp @ %8u\r\n", (unsigned)SYSTIME);

  // todo: more efficient filtering
  if (port == frudp_ucast_builtin_port() ||
      port == frudp_mcast_builtin_port() ||
      port == frudp_ucast_user_port()    ||
      port == frudp_mcast_user_port())
  {
    frudp_rx(udp->ip.source_addr, htons(udp->source_port),
             udp->ip.dest_addr, htons(udp->dest_port),
             payload, payload_len);
    return true;
  }
  printf("unhandled udp: port = %d  payload_len = %d\r\n", port, payload_len);
  return false;
}

// todo: be smarter about multicast group choice
#define MCAST_IP 0xe000008e

#if 0
void enet_tx_state()
{
  //printf("%d enet_tx_state()\r\n", (int)SYSTIME);
  //volatile state_t tx_state = g_state; // make a local copy to ensure coherence
  //uint8_t fake_state[8] = {0};
  g_state.time_us = SYSTIME;
  g_state.channels_active = power_get_state();
  enet_send_udp_mcast(MCAST_IP, 11333,
                      (uint8_t *)&g_state, sizeof(g_state));
}
#endif

#if 0
void enet_systick()
{
  static int s_enet_systick_count = 0;
  if (++s_enet_systick_count % 2000 == 0 &&
      enet_get_link_status() == ENET_LINK_UP)
  {
    if (!enet_master_mac_valid())
    {
      //enet_request_master_mac();
    }
    //printf("enet 1hz systick\r\n");
  }
}
#endif
